starjunes/GD32/source/hal/driver/c/hal_can_drv.c
/******************************************************************************
**
** Filename:     hal_can_drv.c
** Copyright:    
** Description:  该模块主要实现CAN的驱动管理
**
*******************************************************************************
**             Revision history
**-----------------------------------------------------------------------------
**| 2014/03/09 | 叶德焰 |  创建文件
*******************************************************************************/
#include "yx_include.h"
#include "stm32f10x.h"
#include "stm32f10x_conf.h"
#include "yx_dym_drv.h"
#include "yx_loopbuf.h"
#include "hal_can_reg.h"
#include "hal_can_drv.h"
#include "st_irq_drv.h"

#if EN_CAN > 0

/*
********************************************************************************
* define config parameters
********************************************************************************
*/
#define _SENDING             0x01
#define _OPEN                0x80

#define MAX_CAN_SEND         50
#define MAX_CAN_RECV         100

/*
********************************************************************************
* 数据结构定义
********************************************************************************
*/
typedef struct {
    INT8U       pos;
    INT8U       used;
    INT8U       max;
    CAN_DATA_T *pmsg;
} CAN_DATA_Q_T;

typedef struct {
    INT8U        status;
    CAN_DATA_Q_T recvloop;
    CAN_DATA_Q_T sendloop;
} CAN_T;

/*
********************************************************************************
* define module variants
********************************************************************************
*/
static CAN_T s_can[CAN_COM_MAX];
static CAN_DATA_T s_can_recv[CAN_COM_MAX][MAX_CAN_RECV];
static CAN_DATA_T s_can_send[CAN_COM_MAX][MAX_CAN_SEND];


/*******************************************************************
** 函数名称:   LeftOfLoopBuffer
** 函数描述:   获取循环缓冲区中剩余的空间
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       剩余空间字节数
********************************************************************/
INT32U LeftOfLoopBuffer(CAN_DATA_Q_T *loop)
{
    INT32U temp;
    volatile INT32U cpu_sr;
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    temp = loop->max - loop->used;
    OS_EXIT_CRITICAL();                             /* 开中断 */
    
    return temp;
}

/*******************************************************************
** 函数名称:   UsedOfLoopBuffer
** 函数描述:   获取循环缓冲区中已使用空间
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       已使用空间字节数
********************************************************************/
static INT32U UsedOfLoopBuffer(CAN_DATA_Q_T *loop)
{
    INT32U temp;
    volatile INT32U cpu_sr;
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    temp = loop->used;
    OS_EXIT_CRITICAL();                             /* 开中断 */
    
    return temp;
}

/*******************************************************************
** 函数名称:   UsedOfLoopBuffer_INT
** 函数描述:   获取循环缓冲区中已使用空间
** 参数:       [in]  loop:    循环缓冲区管理结构体
** 返回:       已使用空间字节数
********************************************************************/
static INT32U UsedOfLoopBuffer_INT(CAN_DATA_Q_T *loop)
{
    return loop->used;
}

/*******************************************************************
** 函数名称:   ReadLoopData
** 函数描述:   从循环缓冲区中读取一帧数据
** 参数:       [in]  loop:    循环缓冲区管理结构体
**             [out] data:    读取数据
** 返回:       成功返回TRUE,失败返回FALSE
********************************************************************/
static BOOLEAN ReadLoopData(CAN_DATA_Q_T *loop, CAN_DATA_T *data)
{
    INT16U used, pos;
    volatile INT32U cpu_sr;
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    used = loop->used;
    pos  = loop->pos;
    OS_EXIT_CRITICAL();                             /* 开中断 */
    
    if (used == 0) {
        return false;
    }
    
    YX_MEMCPY((INT8U *)data, sizeof(CAN_DATA_T), (INT8U *)&loop->pmsg[pos], sizeof(CAN_DATA_T));
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    loop->used--;
    loop->pos++;
    if (loop->pos >= loop->max) {
        loop->pos -= loop->max;
    }
    OS_EXIT_CRITICAL();                             /* 开中断 */
    return true;
}

/*******************************************************************
** 函数名称:   ReadLoopData_INT
** 函数描述:   从循环缓冲区中读取一帧数据
** 参数:       [in]  loop:    循环缓冲区管理结构体
**             [out] data:    读取数据
** 返回:       成功返回TRUE,失败返回FALSE
********************************************************************/
static BOOLEAN ReadLoopData_INT(CAN_DATA_Q_T *loop, CAN_DATA_T *data)
{
    INT16U used, pos;
    
    used = loop->used;
    pos  = loop->pos;
    
    if (used == 0) {
        return false;
    }
    
    YX_MEMCPY((INT8U *)data, sizeof(CAN_DATA_T), (INT8U *)&loop->pmsg[pos], sizeof(CAN_DATA_T));
    
    loop->used--;
    loop->pos++;
    if (loop->pos >= loop->max) {
        loop->pos -= loop->max;
    }
    return true;
}

/*******************************************************************
** 函数名称:   WriteLoopData
** 函数描述:   往循环缓冲区中写入一帧数据
** 参数:       [in]  loop:   循环缓冲区管理结构体
**             [in]  data:   写入数据
** 返回:       成功返回true,失败返回false
********************************************************************/
static BOOLEAN WriteLoopData(CAN_DATA_Q_T *loop, CAN_DATA_T *data)
{
    INT16U used, pos;
    volatile INT32U cpu_sr;
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    used = loop->used;
    pos  = loop->pos;
    OS_EXIT_CRITICAL();                             /* 开中断 */
    
    if (used >= loop->max) {
        return FALSE;
    }
    
    pos += used;
    if (pos >= loop->max) {
        pos -= loop->max;
    }
        
    YX_MEMCPY((INT8U *)&loop->pmsg[pos], sizeof(CAN_DATA_T), (INT8U *)data, sizeof(CAN_DATA_T));
    
    OS_ENTER_CRITICAL();                            /* 关中断 */
    loop->used++;
    OS_EXIT_CRITICAL();                             /* 开中断 */
    return TRUE;
}

/*******************************************************************
** 函数名称:   WriteLoopData_INT
** 函数描述:   往循环缓冲区中写入一帧数据
** 参数:       [in]  loop:   循环缓冲区管理结构体
**             [in]  data:   写入数据
** 返回:       成功返回true,失败返回false
********************************************************************/
static BOOLEAN WriteLoopData_INT(CAN_DATA_Q_T *loop, CAN_DATA_T *data)
{
    INT16U used, pos;
    
    used = loop->used;
    pos  = loop->pos;
    
