starjunes/GD32/source/hal/driver/c/hal_can_drv.c
    if (used >= loop->max) {
        return FALSE;
    }
    
    pos += used;
    if (pos >= loop->max) {
        pos -= loop->max;
    }
        
    YX_MEMCPY((INT8U *)&loop->pmsg[pos], sizeof(CAN_DATA_T), (INT8U *)data, sizeof(CAN_DATA_T));
    
    loop->used++;
    return TRUE;
}

/*******************************************************************
** 函数名称: STM32_CAN_PinsConfig
** 函数描述: 管脚配置
** 参数:     [in] pinfo: 配置表
**           [in] onoff: 打开/关闭, TRUE-打开串口,FALSE-关闭串口
** 返回:     无
********************************************************************/
static void STM32_CAN_PinsConfig(const CAN_REG_T *pinfo, INT8U onoff)
{
    GPIO_InitTypeDef gpio_initstruct;
    
    if (pinfo == 0) {
        return;
    }
    
    RCC_AHBPeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOB, ENABLE);                        /* 开启GPIO系统时钟 */

    
    /* Configure USARTx_Tx as alternate function push-pull */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->pin_tx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    //gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    //gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        //GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->pin_tx, GPIO_AF_4);
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_Out_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->pin_tx));
    }
    
    /* Configure USARTx_Rx as input floating */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->pin_rx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    //gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    //gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_IPU;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        //GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->pin_rx, GPIO_AF_4);
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_Out_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->pin_rx));
    }

    switch(pinfo->can_base) {
        case CAN1_BASE:
            GPIO_PinRemapConfig(GPIO_Remap1_CAN1 , ENABLE);
            break;
        case CAN2_BASE:
            //GPIO_PinRemapConfig(GPIO_Remap_CAN2, ENABLE);
            break;
    }

}

/*******************************************************************
** 函数名称: STM32_CAN_IrqConfig
** 函数描述: 配置中断功能
** 参数:     [in] pinfo: 配置参数
**           [in] inter: 中断配置
** 返回:     无
********************************************************************/
static void STM32_CAN_IrqConfig(const CAN_REG_T *pinfo)
{
    INT32S irq_id;
    INT32U flag;
    IRQ_SERVICE_FUNC irqhandler;
    
    if (pinfo == 0) {
        return;
    }
    
    switch (pinfo->can_base)
    {
    case CAN1_BASE:
        irq_id = CAN1_RX0_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Rx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN1_RX1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Rx1_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true); 

        irq_id = CAN1_TX_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Tx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);  
    	break;

    case CAN2_BASE: 
        irq_id = CAN2_RX0_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Rx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN2_RX1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Rx1_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN2_TX_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Tx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);  
    	break;
    default:
        return;
    }
    
   
    
    flag = CAN_IT_FF0 | CAN_IT_FF1;// | CAN_IT_BOF | CAN_IT_ERR;
    //flag = CAN_IT_FMP0;
    CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, flag, ENABLE);                 /* Enable Interrupt */
}


#if 0

/*******************************************************************
** 函数名称: CAN_Init1
** 函数描述: CAN总线初始化(对CAN_Init函数的重新实现)
** 参数:     [in] CANx: 寄存器结构体
**           [in] can_initstruct: 参数结构体
** 返回:     无
********************************************************************/
static INT8U CAN_Init1(CAN_TypeDef *CANx, CAN_InitTypeDef *can_initstruct)
{
    INT32U ct_delay = 0x00000000;
    
