starjunes/GD32/source/hal/driver/c/hal_can_drv.c
    CANx->MCR &= (~(INT32U)CAN_MCR_SLEEP);                                     /* Exit from sleep mode */
    CANx->MCR |= CAN_MCR_INRQ ;                                                /* Request initialisation */
    
    while (++ct_delay < 0x100) {                                               /* Wait the acknowledge */
        ClearWatchdog();
        if ((CANx->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) {
            break;
        }
    }
    
    if ((CANx->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) {                          /* Check acknowledge */
        return CAN_InitStatus_Failed;
    }
    
    if (can_initstruct->CAN_TTCM == ENABLE) {                                  /* Set the time triggered communication mode */
        CANx->MCR |= CAN_MCR_TTCM;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_TTCM;
    }

    if (can_initstruct->CAN_ABOM == ENABLE) {                                  /* Set the automatic bus-off management */
        CANx->MCR |= CAN_MCR_ABOM;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_ABOM;
    }

    if (can_initstruct->CAN_AWUM == ENABLE) {                                  /* Set the automatic wake-up mode */
        CANx->MCR |= CAN_MCR_AWUM;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_AWUM;
    }

    if (can_initstruct->CAN_NART == ENABLE) {                                  /* Set the no automatic retransmission */
        CANx->MCR |= CAN_MCR_NART;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_NART;
    }

    if (can_initstruct->CAN_RFLM == ENABLE) {                                  /* Set the receive FIFO locked mode */
        CANx->MCR |= CAN_MCR_RFLM;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_RFLM;
    }

    if (can_initstruct->CAN_TXFP == ENABLE) {                                  /* Set the transmit FIFO priority */
        CANx->MCR |= CAN_MCR_TXFP;
    } else {
        CANx->MCR &= ~(INT32U)CAN_MCR_TXFP;
    }

    /* Set the bit timing register */
    CANx->BTR = (INT32U)((INT32U)can_initstruct->CAN_Mode << 30) | \
                ((INT32U)can_initstruct->CAN_SJW << 24) | \
                ((INT32U)can_initstruct->CAN_BS1 << 16) | \
                ((INT32U)can_initstruct->CAN_BS2 << 20) | \
               ((INT32U)can_initstruct->CAN_Prescaler - 1);

    /* Request leave initialisation */
    CANx->MCR &= ~(INT32U)CAN_MCR_INRQ;

    ct_delay = 0;
    while (++ct_delay < 0x100) {                                               /* Wait the acknowledge */
        ClearWatchdog();
        if ((CANx->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) {
            break;
        }
    }
    
    if ((CANx->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) {                          /* Check acknowledge */
        return CAN_InitStatus_Failed;
    }
    return CAN_InitStatus_Success;
}

#endif

/*******************************************************************
** 函数名称: STM32_CAN_Init
** 函数描述: 串口通信参数配置，并设置是否支持DMA
** 参数:     [in]  cfg:串口配置参数 
** 返回:     无
********************************************************************/
static BOOLEAN STM32_CAN_Init(CAN_CFG_T *cfg)
{
    INT8U com, result = false;
    INT32U baud;
    CAN_InitTypeDef can_initstruct;
    const CAN_REG_T *pinfo;
	  
    com = cfg->com;
    pinfo = HAL_CAN_GetRegTblInfo(com);

    /* can clock enable */
    RCC_APB1PeriphClockCmd(pinfo->can_rcc, ENABLE);
    
    /* deinit can */
	//CAN_DeInit((CAN_TypeDef *)pinfo->can_base);

	
	/* CAN cell init */
	CAN_StructInit(&can_initstruct);
    can_initstruct.CAN_TTCM = DISABLE;                                         /* time triggered communication mode */
    can_initstruct.CAN_ABOM = ENABLE;                                          /* automatic bus-off management */
    can_initstruct.CAN_AWUM = ENABLE;                                          /* automatic wake-up mode */
    can_initstruct.CAN_NART = ENABLE;                                          /* non-automatic retransmission mode */
    can_initstruct.CAN_RFLM = DISABLE;                                         /* Receive FIFO Locked mode */
    can_initstruct.CAN_TXFP = DISABLE;                                         /* transmit FIFO priority */
    switch (cfg->mode)                                                         /* the CAN operating mode */
    {
    case CAN_WORK_MODE_NORMAL:
        can_initstruct.CAN_Mode = CAN_Mode_Normal;
        break;
    case CAN_WORK_MODE_LOOPBACK:
        can_initstruct.CAN_Mode = CAN_Mode_LoopBack;
        break;
    case CAN_WORK_MODE_SILENT:
        can_initstruct.CAN_Mode = CAN_Mode_Silent;
        break;
    case CAN_WORK_MODE_SILENT_LOOPBACK:
        can_initstruct.CAN_Mode = CAN_Mode_Silent_LoopBack;
        break;
    default:
        can_initstruct.CAN_Mode = CAN_Mode_Normal;
        break;
    }
    
    /* CAN Baudrate = 1MBps (CAN clocked at 48 MHz) */
    baud = cfg->baud;
   // can_initstruct.CAN_SJW = CAN_SJW_1tq;                                      /* bit to perform resynchronization */
   // can_initstruct.CAN_BS1 = CAN_BS1_15tq;                                     /* Segment 1 */
   // can_initstruct.CAN_BS2 = CAN_BS2_8tq;                                      /* Segment 2 */
   // can_initstruct.CAN_Prescaler = 2 * (1000000 / baud);                       /* Specifies the length of a time quantum. It ranges from 1 to 1024. */

    can_initstruct.CAN_SJW = CAN_SJW_1tq;                                      /* bit to perform resynchronization */
    can_initstruct.CAN_BS1 = CAN_BS1_3tq;                                     /* Segment 1 */
    can_initstruct.CAN_BS2 = CAN_BS2_2tq;                                     /* Segment 2 */
    can_initstruct.CAN_Prescaler = (36000000 / (baud * (1 + 3 + 2)));       /* Specifies the length of a time quantum. It ranges from 1 to 1024. */
	
	/* configure can */
    result = CAN_Init((CAN_TypeDef *)pinfo->can_base, &can_initstruct);
    if (result == CAN_InitStatus_Success) {
        result = TRUE;
        STM32_CAN_IrqConfig(pinfo);                                            /* 配置中断使能 */
    } else {
        result = FALSE;
    }
    return result;
}

/*******************************************************************
** 函数名称: HAL_CAN_InitDrv
** 函数描述: 初始化驱动
** 参数:     无
** 返回:     无
********************************************************************/
void HAL_CAN_InitDrv(void)
{
    YX_MEMSET(&s_can, 0, sizeof(s_can));
}

/*******************************************************************
** 函数名:     HAL_CAN_GetStatus
** 函数描述:   获取CAN总线状态
** 参数:       [in] com:  通道编号,见 CAN_COM_E
**             [in] info: 状态信息,见 CAN_STATUS_T
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_GetStatus(INT8U com, CAN_STATUS_T *info)
{
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    pinfo = HAL_CAN_GetRegTblInfo(com);
    
