starjunes/GD32/source/hal/driver/c/hal_can_drv.c
    info->status = HAL_CAN_IsOpened(com);
    info->lec    = CAN_GetLastErrorCode((CAN_TypeDef *)pinfo->can_base) >> 4;
    info->rec    = CAN_GetReceiveErrorCounter((CAN_TypeDef *)pinfo->can_base);
    info->tec    = CAN_GetLSBTransmitErrorCounter((CAN_TypeDef *)pinfo->can_base);
    
    if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_BOF) == SET) {/* 总线关闭 */
        info->errorstep = CAN_ERROR_STEP_BUSOFF;
    } else if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_EPV) == SET) {/* 被动错误 */
        info->errorstep = CAN_ERROR_STEP_PASSIVE;
    } else if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_EWG) == SET) {/* 错误警告 */
        info->errorstep = CAN_ERROR_STEP_WARNING;
    } else if (info->rec > 0 && info->tec > 0) {                               /* 主动错误 */
        info->errorstep = CAN_ERROR_STEP_ACTIVE;
    } else {
        info->errorstep = CAN_ERROR_STEP_NOERR;
    }
    
    return true;
}

/*******************************************************************
** 函数名称:   HAL_CAN_IsOpened
** 函数描述:   通道是否已打开
** 参数:       [in] com: 通道编号,见CAN_COM_E
** 返回:       是返回true,否返回false
********************************************************************/
BOOLEAN HAL_CAN_IsOpened(INT8U com)
{
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status &_OPEN) != 0) {
        return true;
    } else {
        return false;
    }
}

/*******************************************************************
** 函数名称:   HAL_CAN_OpenCan
** 函数描述:   打开CAN通信总线
** 参数:       [in]  cfg: 配置参数 
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_CAN_OpenCan(CAN_CFG_T *cfg)
{
    INT8U com;
    const CAN_REG_T *pinfo;
    
    OS_ASSERT((cfg != 0), RETURN_FALSE);
    //OS_ASSERT((cfg->com < CAN_COM_MAX), RETURN_FALSE);
    if (cfg->com >= CAN_COM_MAX) {
        return false;
    }
    
    com = cfg->com;
    pinfo = HAL_CAN_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) != 0) {                                    /* 已打开 */
        s_can[com].status &= ~(_OPEN | _SENDING);
        
	    CAN_DeInit((CAN_TypeDef *)pinfo->can_base);                            /* deinit can */
    }
    
    s_can[com].recvloop.pmsg = &s_can_recv[com][0];                            /* 接收缓存 */
    s_can[com].recvloop.used = 0;
    s_can[com].recvloop.pos  = 0;
    s_can[com].recvloop.max  = MAX_CAN_RECV;
    
    s_can[com].sendloop.pmsg = &s_can_send[com][0];                            /* 发送缓存 */
    s_can[com].sendloop.used = 0;
    s_can[com].sendloop.pos  = 0;
    s_can[com].sendloop.max  = MAX_CAN_SEND;
    
    STM32_CAN_PinsConfig(pinfo, TRUE);                                         /* configure the rx & tx pins */
    if (STM32_CAN_Init(cfg)) {                                                 /* 通信参数配置 */
        s_can[com].status = _OPEN;
        return true;
    } else {
        return false;
    }
}

/*******************************************************************
** 函数名:     HAL_CAN_CloseCan
** 函数描述:   关闭CAN总线
** 参数:       [in] com: 通道编号,见CAN_COM_E
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_CloseCan(INT8U com)
{
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    pinfo = HAL_CAN_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    STM32_CAN_PinsConfig(pinfo, FALSE);
    if ((s_can[com].status & _OPEN) != 0) {                                    /* 串口已打开 */
        CAN_DeInit((CAN_TypeDef *)pinfo->can_base);                            /* deinit can */
    }
    s_can[com].status &= ~(_OPEN | _SENDING);
    
    return true;
}

/*******************************************************************
** 函数名:     HAL_CAN_SetFilterParaByList
** 函数描述:   设置滤波参数,设置滤波ID列表过滤方式
** 参数:       [in] com:       通道编号,见 CAN_COM_E
**             [in] idtype:    帧ID类型,见 CAN_ID_TYPE_E
**             [in] idnum:     滤波ID个数,为0时表示接收所有ID
**             [in] pfilterid: 滤波ID数组
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_SetFilterParaByList(INT8U com, INT8U idtype, INT8U idnum, INT32U *pfilterid)
{
    INT8U i;
    INT8U ch_offset; 
    INT32U filterid;
    CAN_FilterInitTypeDef  can_filterinitstructure;
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return false;
    }

    pinfo = HAL_CAN_GetRegTblInfo(com);
    ch_offset = (com * 14);
    if (idtype == CAN_ID_TYPE_STD) {                                           /* 标准帧 */
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdList;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_16bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
        
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_LIST_STD; i++) {
            filterid = pfilterid[i] << 5;
            
            if ((i % 4) == 0) {
                can_filterinitstructure.CAN_FilterIdHigh     = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdHigh = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 4 + ch_offset;
            } else if ((i % 4) == 1) {
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
            } else if ((i % 4) == 2) {
                can_filterinitstructure.CAN_FilterMaskIdHigh = filterid & 0xFFFF;
            } else if ((i % 4) == 3) {
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 4 + ch_offset;
                CAN_FilterInit(&can_filterinitstructure);
            }
        }
        
        if ((i % 4) != 0) {
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (i = (i + 3) / 4; i < MAX_CAN_FILTER_ID_BANK; i++) {               /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    } else {
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdList;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_32bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
            
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_LIST_EXT; i++) {
            filterid = (pfilterid[i] << 3) | 0x04;                             /* 0x04表示扩展帧 */
            
            if ((i % 2) == 0) {
                can_filterinitstructure.CAN_FilterIdHigh     = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdHigh = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
            } else {
                can_filterinitstructure.CAN_FilterMaskIdHigh = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
                CAN_FilterInit(&can_filterinitstructure);
            }
        }
        
        if ((i % 2) != 0) {
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (i = (i + 1) / 2; i < MAX_CAN_FILTER_ID_BANK; i++) {               /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    }
    
    if (idnum == 0) {                                                          /* 滤波ID个数为0,表示不滤波,接收所有数据帧 */
        can_filterinitstructure.CAN_FilterMode       = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterActivation = ENABLE;
        can_filterinitstructure.CAN_FilterIdHigh     = 0;
        can_filterinitstructure.CAN_FilterIdLow      = 0;
        can_filterinitstructure.CAN_FilterMaskIdHigh = 0;
        can_filterinitstructure.CAN_FilterMaskIdLow  = 0;
        can_filterinitstructure.CAN_FilterNumber     = 0 + ch_offset;
        CAN_FilterInit(&can_filterinitstructure);
    }
    return true;
}

/*******************************************************************
** 函数名:     HAL_CAN_SetFilterParaByMask
** 函数描述:   设置滤波参数,设置滤波ID掩码过滤方式
** 参数:       [in] com:      通道编号,见 CAN_COM_E
**             [in] idtype:   帧ID类型,见 CAN_ID_TYPE_E
**             [in] idnum:    滤波ID个数,为0时表示接收所有ID
**             [in] pfilterid: 滤波ID数组
**             [in] pmaskid:   掩码ID数组
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_SetFilterParaByMask(INT8U com, INT8U idtype, INT8U idnum, INT32U *pfilterid, INT32U *pmaskid)
{
    INT8U i;
    INT8U ch_offset;                                                           /* 通道偏移 */
    INT32U filterid, maskid;
    CAN_FilterInitTypeDef  can_filterinitstructure;
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return false;
    }

    pinfo = HAL_CAN_GetRegTblInfo(com);
    ch_offset = (com*14);
    if (idtype == CAN_ID_TYPE_STD) {
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_16bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
        
