starjunes/GD32/source/hal/driver/c/hal_can_drv.c
            for (j = 0; j < rxmessage.DLC; j++) {
                recvdata.data[j] = rxmessage.Data[j];
            }
            
            WriteLoopData_INT(&s_can[com].recvloop, &recvdata);
        }
    }
#else
    
    if (CAN_GetFlagStatus(CAN, CAN_FLAG_FF0) != RESET) {                       /* FIFO0数据接收中断 */
        CAN_ClearITPendingBit(CAN, CAN_IT_FF0);                                /* Clears the CAN1 interrupt pending bit */
        
        for (i = 0; i < 3; i++) {
            CAN_Receive(CAN, CAN_FIFO0, &rxmessage);
            
            if (rxmessage.IDE == CAN_ID_STD) {
                recvdata.idtype = CAN_ID_TYPE_STD;
                recvdata.id     = rxmessage.StdId;
            } else {
                recvdata.idtype = CAN_ID_TYPE_EXT;
                recvdata.id     = rxmessage.ExtId;
            }
            
            if (rxmessage.RTR == CAN_RTR_DATA) {
                recvdata.datatype = CAN_RTR_TYPE_DATA;
            } else {
                recvdata.datatype = CAN_RTR_TYPE_REMOTE;
            }
            
            recvdata.index = rxmessage.FMI;
            recvdata.dlc   = rxmessage.DLC;
            
            for (j = 0; j < rxmessage.DLC; j++) {
                recvdata.data[j] = rxmessage.Data[j];
            }
            
            WriteLoopData_INT(&s_can[com].recvloop, &recvdata);
            //printf_com("CAN1_IrqHandle(%x)(%d)(%d)\r\n", recvdata.id, recvdata.idtype, recvdata.datatype);
        }
    }
    
    if (CAN_GetFlagStatus(CAN, CAN_FLAG_FF1) != RESET) {                       /* FIFO1数据接收中断 */
        CAN_ClearITPendingBit(CAN, CAN_IT_FF1);                                /* Clears the CAN1 interrupt pending bit */
        
        for (i = 0; i < 3; i++) {
            CAN_Receive(CAN, CAN_FIFO1, &rxmessage);
            
            if (rxmessage.IDE == CAN_ID_STD) {
                recvdata.idtype = CAN_ID_TYPE_STD;
                recvdata.id     = rxmessage.StdId;
            } else {
                recvdata.idtype = CAN_ID_TYPE_EXT;
                recvdata.id     = rxmessage.ExtId;
            }
            
            if (rxmessage.RTR == CAN_RTR_DATA) {
                recvdata.datatype = CAN_RTR_TYPE_DATA;
            } else {
                recvdata.datatype = CAN_RTR_TYPE_REMOTE;
            }
            
            recvdata.index = rxmessage.FMI;
            recvdata.dlc   = rxmessage.DLC;
            
            for (j = 0; j < rxmessage.DLC; j++) {
                recvdata.data[j] = rxmessage.Data[j];
            }
            
            WriteLoopData_INT(&s_can[com].recvloop, &recvdata);
        }
    }
#endif
    
    if (CAN_GetITStatus(CAN, CAN_IT_TME) != RESET) {                           /* 数据发送中断 */
        CAN_ClearITPendingBit(CAN, CAN_IT_TME);                                /* Clears the CAN1 interrupt pending bit */
        
        pinfo = HAL_CAN_GetRegTblInfo(com);
        if (((s_can[com].status & _OPEN) == 0) || ((s_can[com].status & _SENDING) == 0)) {
            CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
        } else {
            used = UsedOfLoopBuffer_INT(&s_can[com].sendloop);
            if (used == 0) {                                                   /* 无数据要发送 */
                s_can[com].status &= (~_SENDING);
                CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
            } else {
                ReadLoopData_INT(&s_can[com].sendloop, &recvdata);
                StartCanSend(pinfo, &recvdata);
            }
        }
    }
}

#endif

#endif


